In [1]:
import pandas as pd

In [7]:
# INICIANDO COM DATAFRAME
pd.DataFrame({'Yes': [50, 105], 'No': [500, 300]})

   Yes   No
0   50  500
1  105  300

In [13]:
# NO INDEX É CRIADO AUTOMATICAMENTE
pd.DataFrame({'Name': ['Wes McKinney', 'Guido Van Rossum'], 'Number': [500, 120]})

               Name  Number
0      Wes McKinney     500
1  Guido Van Rossum     120

In [17]:
# Alterando os valores do index
pd.DataFrame({
    'Column 1': [20, 50, 60],
    'Column 2': [25, 60, 20],
    'Column 3': ['hello', 'how are you', 'bye']
}, index=['Linha 1', 'Linha 2', 'Linha 3'])

         Column 1  Column 2     Column 3
Linha 1        20        25        hello
Linha 2        50        60  how are you
Linha 3        60        20          bye

In [19]:
# INICIANDO SERIES
pd.Series([1, 2, 4, 6, 8, 10])

0     1
1     2
2     4
3     6
4     8
5    10
dtype: int64

In [25]:
pd.Series([1, 2, 3], index=['Valor 1', 'Valor 2', 'Valor 3'], name='LISTA NÚMERO UM')

Valor 1    1
Valor 2    2
Valor 3    3
Name: LISTA NÚMERO UM, dtype: int64

In [28]:
csv_titanic = pd.read_csv('titanic.csv')

In [30]:
csv_titanic.shape

(418, 11)

In [34]:
csv_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S